# 1.Pandas DataFrame

In [3]:
#모듈 임폴트
import pandas as pd

In [7]:
data = {'1.name': ['A고객','B고객','C고객','D고객', 'F고객'], # 딕셔너리 안에 키의 벨류값이 리스트형식으로 들어갈수있다
        '2.age': [27,40,33,29,20],                          # 순서는 키의 a,b,c순서로 나타남
        '3.stock_age': [2,10,5,1,1]}
dataFrame = pd.DataFrame(data)
type(dataFrame) #type(변수명) --> 변수의 타입 확인
#dataFrame.columns=["NAME","AGE","STOCK"]

pandas.core.frame.DataFrame

In [8]:
print(dataFrame)

  1.name  2.age  3.stock_age
0    A고객     27            2
1    B고객     40           10
2    C고객     33            5
3    D고객     29            1
4    F고객     20            1

# 2.리스트를 활용한 데이터 분석을 위한 자료구조 생성

In [9]:
import pandas as pd
# 리스트 생성
test = [10,100,1000,10000]
# 데이터프레임 변환
testDf = pd.DataFrame(test)
testDf

testDf.columns=["test"]
testDf

    test
0     10
1    100
2   1000
3  10000

In [10]:
import pandas as pd
date = ['16.02.29', '16.02.26', '16.02.25', '16.02.24', '16.02.23']
date2 = ['17.02.29', '17.02.26', '17.02.25', '17.02.24', '17.02.23']

date_df = pd.DataFrame(date, columns=['date2'])
date_df2 = pd.DataFrame(date2, columns=['date23'])

final = pd.concat([date_df,date_df2], axis = 1)
final

      date2    date23
0  16.02.29  17.02.29
1  16.02.26  17.02.26
2  16.02.25  17.02.25
3  16.02.24  17.02.24
4  16.02.23  17.02.23

In [12]:
import pandas as pd
Mydata = {'1.이름' : ['김','이','박'],
        '2.나이' : ['20','21','30'],
         '3.주소' : ['서울','대전','부산']}
Mydata_Frame = pd.DataFrame(Mydata)
Mydata_Frame
date23 = ['90.04.12', '92.11.09', '93.09.31']
data2_Frame = pd.DataFrame(date23, columns=['4. 생일'])
data2_Frame
final = pd.concat([Mydata_Frame,data2_Frame], axis = 1)
final

  1.이름 2.나이 3.주소     4. 생일
0    김   20   서울  90.04.12
1    이   21   대전  92.11.09
2    박   30   부산  93.09.31